DemoLogin_1/app/models/user.rb

SELECT "users".* FROM "users" WHERE (lower(username) = 'khoa123' OR lower(email) = 'khoa123') ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE (lower(username) = 'khoa@gmail.com' OR lower(email) = 'khoa@gmail.com') ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def self.find_for_database_authentication(warden_conditions)
    login = warden_conditions.to_h[:login]
    where('lower(username) = :value OR lower(email) = :value', value: login.downcase).first