scheduled_tweets/app/controllers/passwords_controller.rb

  def update
    if Current.user.update(password_params)
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$12$p5fVG9Lr/AdTLYUDiyCPrOXlbLIsfENRa/BFbF/Z3rM32MQHNUclq"], ["updated_at", "2022-12-17 02:29:35.060204"], ["id", 7]]