scheduled_tweets/app/controllers/sessions_controller.rb

  def create
    user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "khoa1@gmail.com"], ["LIMIT", 1]]