my_blog/app/controllers/home_controller.rb

SELECT "posts".* FROM "posts"
---
    def index
        @post=Post.all