DemoLogin_1/app/controllers/pages_controller.rb

SELECT "timesheets".* FROM "timesheets"
---
  def index
    @timesheets = Timesheet.all

SELECT "users".* FROM "users" WHERE (email LIKE '%khoa1233%') LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 0]]
---
  def get_users
    @users = User.all