DemoLogin_1/app/controllers/timesheets_controller.rb

  def index
    @timesheets =
      if params[:user_id].blank?
        Timesheet.all
      else
        Timesheet.where(user_id: params[:user_id])
---
SELECT "timesheets".* FROM "timesheets"
SELECT "timesheets".* FROM "timesheets" WHERE "timesheets"."user_id" = ?  [["user_id", 2]]

  def create
    @timesheet = if current_user.admin?
                   Timesheet.new(timesheet_params)
                 else
                   Timesheet.new(timesheet_params.merge(user_id: curent_user.id))
                 end

    if @timesheet.save
---
INSERT INTO "timesheets" ("check_in", "check_out", "day", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def show
    @timesheet = Timesheet.find(params[:id])
---
SELECT "timesheets".* FROM "timesheets" WHERE "timesheets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    if @timesheet.update(timesheet_params)
---
UPDATE "timesheets" SET "check_in" = ?, "check_out" = ?, "day" = ?, "updated_at" = ? WHERE "timesheets"."id" = ?  [["check_in", "2000-01-01 00:00:00"], ["check_out", "2000-01-01 01:00:00"], ["day", "2022-02-01 00:00:00"], ["updated_at", "2022-12-14 09:57:21.887555"], ["id", 1]]

  def set_timesheet
    @timesheet = Timesheet.find(params[:id])
---
SELECT "timesheets".* FROM "timesheets" WHERE "timesheets"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]